{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "/root/.cache/modelscope/hub/models/deepseek-ai",
  "bias": "none",
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 12,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [],
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": "(?!^(projector))^(language)(?!.*(lora_A|lora_B|base_layer|emb|wte|shared|lm_head|output|score|v_head|classifier)).*",
  "task_type": "CAUSAL_LM",
  "use_dora": false,
  "use_rslora": false
}